問題なくapply通った！
```
➜  terraform git:(master) ✗ terraform apply

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_linux_virtual_machine.sample-vm will be created
  + resource "azurerm_linux_virtual_machine" "sample-vm" {
      + admin_username                  = "sampleadm"
      + allow_extension_operations      = true
      + computer_name                   = "sample-vm"
      + disable_password_authentication = true
      + id                              = (known after apply)
      + location                        = "japaneast"
      + max_bid_price                   = -1
      + name                            = "sample-vm"
      + network_interface_ids           = (known after apply)
      + priority                        = "Regular"
      + private_ip_address              = (known after apply)
      + private_ip_addresses            = (known after apply)
      + provision_vm_agent              = true
      + public_ip_address               = (known after apply)
      + public_ip_addresses             = (known after apply)
      + resource_group_name             = "sample-rg"
      + size                            = "Standard_B1MS"
      + tags                            = {
          + "environment" = "Terraform Demo"
        }
      + virtual_machine_id              = (known after apply)
      + zone                            = (known after apply)

      + admin_ssh_key {
          + public_key = (known after apply)
          + username   = "sampleadm"
        }

      + os_disk {
          + caching                   = "ReadWrite"
          + disk_size_gb              = (known after apply)
          + name                      = "myOsDisk"
          + storage_account_type      = "Premium_LRS"
          + write_accelerator_enabled = false
        }

      + source_image_reference {
          + offer     = "UbuntuServer"
          + publisher = "Canonical"
          + sku       = "16.04.0-LTS"
          + version   = "latest"
        }
    }

  # azurerm_network_interface.sample-vnic will be created
  + resource "azurerm_network_interface" "sample-vnic" {
      + applied_dns_servers           = (known after apply)
      + dns_servers                   = (known after apply)
      + enable_accelerated_networking = false
      + enable_ip_forwarding          = false
      + id                            = (known after apply)
      + internal_dns_name_label       = (known after apply)
      + internal_domain_name_suffix   = (known after apply)
      + location                      = "japaneast"
      + mac_address                   = (known after apply)
      + name                          = "sample-vnic"
      + private_ip_address            = (known after apply)
      + private_ip_addresses          = (known after apply)
      + resource_group_name           = "sample-rg"
      + tags                          = {
          + "environment" = "Terraform Demo"
        }
      + virtual_machine_id            = (known after apply)

      + ip_configuration {
          + name                          = "myNicConfiguration"
          + primary                       = (known after apply)
          + private_ip_address            = (known after apply)
          + private_ip_address_allocation = "dynamic"
          + private_ip_address_version    = "IPv4"
          + public_ip_address_id          = (known after apply)
          + subnet_id                     = (known after apply)
        }
    }

  # azurerm_network_interface_security_group_association.network_interface_security_group_association will be created
  + resource "azurerm_network_interface_security_group_association" "network_interface_security_group_association" {
      + id                        = (known after apply)
      + network_interface_id      = (known after apply)
      + network_security_group_id = (known after apply)
    }

  # azurerm_network_security_group.sample-sg will be created
  + resource "azurerm_network_security_group" "sample-sg" {
      + id                  = (known after apply)
      + location            = "japaneast"
      + name                = "sample-sg"
      + resource_group_name = "sample-rg"
      + security_rule       = [
          + {
              + access                                     = "Allow"
              + description                                = ""
              + destination_address_prefix                 = "*"
              + destination_address_prefixes               = []
              + destination_application_security_group_ids = []
              + destination_port_range                     = "22"
              + destination_port_ranges                    = []
              + direction                                  = "Inbound"
              + name                                       = "SSH"
              + priority                                   = 1001
              + protocol                                   = "Tcp"
              + source_address_prefix                      = "*"
              + source_address_prefixes                    = []
              + source_application_security_group_ids      = []
              + source_port_range                          = "*"
              + source_port_ranges                         = []
            },
        ]
      + tags                = {
          + "environment" = "Terraform Demo"
        }
    }

  # azurerm_public_ip.sample-public-ip will be created
  + resource "azurerm_public_ip" "sample-public-ip" {
      + allocation_method       = "Dynamic"
      + fqdn                    = (known after apply)
      + id                      = (known after apply)
      + idle_timeout_in_minutes = 4
      + ip_address              = (known after apply)
      + ip_version              = "IPv4"
      + location                = "japaneast"
      + name                    = "sample-public-ip"
      + resource_group_name     = "sample-rg"
      + sku                     = "Basic"
      + tags                    = {
          + "environment" = "Terraform Demo"
        }
    }

  # azurerm_resource_group.sample-rg will be created
  + resource "azurerm_resource_group" "sample-rg" {
      + id       = (known after apply)
      + location = "japaneast"
      + name     = "sample-rg"
      + tags     = {
          + "environment" = "Terraform Demo"
        }
    }

  # azurerm_subnet.sample-subnet will be created
  + resource "azurerm_subnet" "sample-subnet" {
      + address_prefix                                 = (known after apply)
      + address_prefixes                               = [
          + "10.0.2.0/24",
        ]
      + enforce_private_link_endpoint_network_policies = false
      + enforce_private_link_service_network_policies  = false
      + id                                             = (known after apply)
      + name                                           = "sample-subnet"
      + resource_group_name                            = "sample-rg"
      + virtual_network_name                           = "sample-vnet"
    }

  # azurerm_virtual_network.sample-vnet will be created
  + resource "azurerm_virtual_network" "sample-vnet" {
      + address_space       = [
          + "10.0.0.0/16",
        ]
      + guid                = (known after apply)
      + id                  = (known after apply)
      + location            = "japaneast"
      + name                = "sample-vnet"
      + resource_group_name = "sample-rg"
      + subnet              = (known after apply)
      + tags                = {
          + "environment" = "Terraform Demo"
        }
    }

  # tls_private_key.sample-ssh will be created
  + resource "tls_private_key" "sample-ssh" {
      + algorithm                  = "RSA"
      + ecdsa_curve                = "P224"
      + id                         = (known after apply)
      + private_key_pem            = (sensitive value)
      + public_key_fingerprint_md5 = (known after apply)
      + public_key_openssh         = (known after apply)
      + public_key_pem             = (known after apply)
      + rsa_bits                   = 4096
    }

Plan: 9 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.
```

Portalから確認しても、問題なさそう！
![image](https://user-images.githubusercontent.com/34146717/85218688-85a8e380-b3d7-11ea-8123-a33fb754d850.png)
